rbuj/explorer16/LEDsOnOffS3.X/system_config/exp16/pic24fj128ga010_pim/system.c
/* Explorer 16 Examples
 * Copyright (C) 2018  Robert Buj <rbuj@fedoraproject.org>
 * 
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 * 
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 * 
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */
/******************************************************************************/
/* Files to Include                                                           */
/******************************************************************************/
#include <xc.h>
#include <stdbool.h> /* Includes true/false definition */
#include "app.h"

// CONFIG2
#pragma config POSCMOD = XT             // Primary Oscillator Select (XT Oscillator mode selected)
#pragma config OSCIOFNC = OFF           // Primary Oscillator Output Function (OSC2/CLKO/RC15 functions as CLKO (FOSC/2))
#pragma config FCKSM = CSDCMD           // Clock Switching and Monitor (Clock switching and Fail-Safe Clock Monitor are disabled)
#pragma config FNOSC = PRI              // Oscillator Select (Primary Oscillator (XT, HS, EC))
#pragma config IESO = ON                // Internal External Switch Over Mode (IESO mode (Two-Speed Start-up) enabled)

// CONFIG1
#pragma config WDTPS = PS32768          // Watchdog Timer Postscaler (1:32,768)
#pragma config FWPSA = PR128            // WDT Prescaler (Prescaler ratio of 1:128)
#pragma config WINDIS = ON              // Watchdog Timer Window (Standard Watchdog Timer enabled,(Windowed-mode is disabled))
#pragma config FWDTEN = OFF             // Watchdog Timer Enable (Watchdog Timer is disabled)
#pragma config ICS = PGx2               // Comm Channel Select (Emulator/debugger uses EMUC2/EMUD2)
#pragma config GWRP = OFF               // General Code Segment Write Protect (Writes to program memory are allowed)
#pragma config GCP = OFF                // General Code Segment Code Protect (Code protection is disabled)
#pragma config JTAGEN = OFF             // JTAG Port Enable (JTAG port is disabled)

/******************************************************************************/
/* Trap Function Prototypes                                                   */
/******************************************************************************/
// <editor-fold defaultstate="collapsed" desc="Interrupt Vector Table: Use if ALTIVT=0 (INTCON2<15>)">
void __attribute__((__interrupt__, auto_psv)) _OscillatorFail(void);
void __attribute__((__interrupt__, auto_psv)) _AddressError(void);
void __attribute__((__interrupt__, auto_psv)) _StackError(void);
void __attribute__((__interrupt__, auto_psv)) _MathError(void);
// </editor-fold>
// <editor-fold defaultstate="collapsed" desc="Alternate Interrupt Vector Table: Use if ALTIVT=1 (INTCON2<15>)">
#if defined(__PIC24F__)||defined(__PIC24H__)
void __attribute__((__interrupt__, auto_psv)) _AltOscillatorFail(void);
void __attribute__((__interrupt__, auto_psv)) _AltAddressError(void);
void __attribute__((__interrupt__, auto_psv)) _AltStackError(void);
void __attribute__((__interrupt__, auto_psv)) _AltMathError(void);
#endif
// </editor-fold>
// <editor-fold defaultstate="collapsed" desc="Additional traps in the 24E family. No Alternate Vectors in the 24E family. ">
#if defined(__PIC24E__)

void __attribute__((interrupt, no_auto_psv)) _HardTrapError(void);
void __attribute__((interrupt, no_auto_psv)) _DMACError(void);
void __attribute__((interrupt, no_auto_psv)) _SoftTrapError(void);

#endif
// </editor-fold>
// <editor-fold defaultstate="collapsed" desc="Default interrupt handler">
void __attribute__((interrupt, no_auto_psv)) _DefaultInterrupt(void);
// </editor-fold>

void SYS_Initialize(void) {
    /* Enable LEDs */
    LEDs_Enable();

    /* Turn Off LEDs */
    LEDs_Off();

    /* Enable Switch S3 */
    BUTTON_Enable(BUTTON_S3);

    /* Enable ADC to the Potentiometer channel */
    ADC_ChannelEnable(ADC_CHANNEL_POTENTIOMETER);

    /* Initialize LCD */
    PRINT_SetConfiguration(PRINT_CONFIGURATION_LCD);

    /****************************************************************************
     * Interrupt On Change for group CNEN1
     ***************************************************************************/
    CNEN1bits.CN15IE = 1; // Enable RD6 for CN interrupt
    IEC1bits.CNIE = 1; // Enable CN interrupts
    IFS1bits.CNIF = 0; // Reset CN interrupt
}

void __attribute__((interrupt, no_auto_psv)) _CNInterrupt(void) {
    if (IFS1bits.CNIF == 1) {
        IFS1bits.CNIF = 0; // Clear the flag
        LEDs_Toggle(); // Toggle LEDs
    }
}

/******************************************************************************/
/* Trap Handling                                                              */
/******************************************************************************/
// <editor-fold defaultstate="collapsed" desc="Primary (non-alternate) address error trap function declarations">

void __attribute__((__interrupt__, auto_psv)) _OscillatorFail(void) {
    INTCON1bits.OSCFAIL = 0; // Clear the trap flag
    while (true);
}

void __attribute__((__interrupt__, auto_psv)) _AddressError(void) {
    INTCON1bits.ADDRERR = 0; // Clear the trap flag
    while (true);
}

void __attribute__((__interrupt__, auto_psv)) _StackError(void) {
    INTCON1bits.STKERR = 0; // Clear the trap flag
    while (true);
}

void __attribute__((__interrupt__, auto_psv)) _MathError(void) {
    INTCON1bits.MATHERR = 0; // Clear the trap flag
    while (true);
}

// </editor-fold>
// <editor-fold defaultstate="collapsed" desc="Alternate address error trap function declarations">
#if defined(__PIC24F__)||defined(__PIC24H__)

void __attribute__((__interrupt__, auto_psv)) _AltOscillatorFail(void) {
    INTCON1bits.OSCFAIL = 0; // Clear the trap flag
    while (true);
}

void __attribute__((__interrupt__, auto_psv)) _AltAddressError(void) {
    INTCON1bits.ADDRERR = 0; // Clear the trap flag
    while (true);
}

void __attribute__((__interrupt__, auto_psv)) _AltStackError(void) {
    INTCON1bits.STKERR = 0; // Clear the trap flag
    while (true);
}

void __attribute__((__interrupt__, auto_psv)) _AltMathError(void) {
    INTCON1bits.MATHERR = 0; // Clear the trap flag
    while (true);
}

#endif
// </editor-fold>
// <editor-fold defaultstate="collapsed" desc="Specific traps for PIC24E family">
#if defined(__PIC24E__)

void __attribute__((interrupt, no_auto_psv)) _HardTrapError(void) {
    while (true);
}

void __attribute__((interrupt, no_auto_psv)) _DMACError(void) {
    while (1);
}

void __attribute__((interrupt, no_auto_psv)) _SoftTrapError(void) {
    while (true);
}

#endif
// </editor-fold>
// <editor-fold defaultstate="collapsed" desc="Default Interrupt Handler">

void __attribute__((interrupt, no_auto_psv)) _DefaultInterrupt(void) {
    while (true);
}

// </editor-fold>
